/*
7-36 复数四则运算 （15 分）
本题要求编写程序，计算2个复数的和、差、积、商。

输入格式：

输入在一行中按照a1 b1 a2 b2的格式给出2个复数C1=a1+b1i和C2=a2+b2i的实部和虚部。题目保证C2不为0。

输出格式：

分别在4行中按照(a1+b1i) 运算符 (a2+b2i) = 结果的格式顺序输出2个复数的和、差、积、商，数字精确到小数点后1位。如果结果的实部或者虚部为0，则不输出。如果结果为0，则输出0.0。

输入样例1：

2 3.08 -2.04 5.06
输出样例1：

(2.0+3.1i) + (-2.0+5.1i) = 8.1i
(2.0+3.1i) - (-2.0+5.1i) = 4.0-2.0i
(2.0+3.1i) * (-2.0+5.1i) = -19.7+3.8i
(2.0+3.1i) / (-2.0+5.1i) = 0.4-0.6i
输入样例2：

1 1 -1 -1.01
输出样例2：

(1.0+1.0i) + (-1.0-1.0i) = 0.0
(1.0+1.0i) - (-1.0-1.0i) = 2.0+2.0i
(1.0+1.0i) * (-1.0-1.0i) = -2.0i
(1.0+1.0i) / (-1.0-1.0i) = -1.0
*/

#include "cstdio"
#include "cmath"

float a1 = 0, b1 = 0, a2 = 0, b2 = 0;

void printResult(char c, float a, float b)
{
    printf("(%.1f%+.1fi) %c (%.1f%+.1fi) = ", a1, b1, c, a2, b2);

    if (fabs(a) < 0.1 && fabs(b) < 0.1)
    {
        printf("0.0");
    }
    else if (fabs(a) < 0.1)
    {
        printf("%.1fi", b);
    }
    else if (fabs(b) < 0.1)
    {
        printf("%.1f", a);
    }
    else
    {
        printf("%.1f%+.1fi", a, b);
    }
    printf("\n");
}

int main()
{
    scanf("%f %f %f %f", &a1, &b1, &a2, &b2);

    printResult('+', a1 + a2, b1 + b2);
    printResult('-', a1 - a2, b1 - b2);
    printResult('*', a1 * a2 - b1 * b2, b1 * a2 + a1 * b2);
    printResult('/', (a1 * a2 + b1 * b2) / (a2 * a2 + b2 * b2), (b1 * a2 - a1 * b2) / (a2 * a2 + b2 * b2));

    return 0;
}