/**
 * @file P2676 [USACO07DEC]Bookshelf B.cpp
 * @date 2022-06-05
 */

/*
# [USACO07DEC]Bookshelf B

## 题目描述

Farmer John最近为奶牛们的图书馆添置了一个巨大的书架，尽管它是如此的大，但它还是几乎瞬间就被各种各样的书塞满了。现在，只有书架的顶上还留有一点空间。 

所有 $N(1 \le N \le 20,000)$ 头奶牛都有一个确定的身高 $H_i(1 \le H_i \le 10,000)$。设所有奶牛身高的和为S。书架的高度为B，并且保证 $1 \le B \le S < 2,000,000,007$。 

为了够到比最高的那头奶牛还要高的书架顶，奶牛们不得不像演杂技一般，一头站在另一头的背上，叠成一座“奶牛塔”。当然，这个塔的高度，就是塔中所有奶牛的身高之和。为了往书架顶上放东西，所有奶牛的身高和必须不小于书架的高度。

显然，塔中的奶牛数目越多，整座塔就越不稳定，于是奶牛们希望在能够到书架顶的前提下，让塔中奶牛的数目尽量少。 现在，奶牛们找到了你，希望你帮她们计算这个最小的数目。

## 输入格式

* 第 1 行: 2 个用空格隔开的整数：N 和 B
* 第 $2..N+1$ 行: 第 i+1 行是 1 个整数：$H_i$

## 输出格式

* 第 1 行: 输出 1 个整数，即最少要多少头奶牛叠成塔，才能够到书架顶部

## 样例 #1

### 样例输入 #1

```
6 40
6
18
11
13
19
11
```

### 样例输出 #1

```
3
```

## 提示

输入说明:

一共有6头奶牛，书架的高度为40，奶牛们的身高在6..19之间。


输出说明:

一种只用3头奶牛就达到高度40的方法：18+11+13。当然还有其他方法，在此不一一列出了。
*/

/* 排序，从大往小加，一个个加，最后加到直到身高大于等于书架高度为止 */

/* 题目的要求是身高不能小于书架的高度，如果题目改成身高要恰好等于书架的高度，又该如何呢？ */

#include <algorithm>
#include <cstdio>
#include <vector>
using namespace std;

vector<int> vec;

int main() {

    int n = 0, b = 0;
    scanf("%d %d", &n, &b);

    vec.resize(n);

    for (int i = 0; i < n; i++)
        scanf("%d", &vec[i]);

    sort(vec.begin(), vec.end());

    int idx = vec.size() - 1;
    int height = 0;
    while (idx >= 0 && height < b) {
        height += vec[idx];
        idx--;
    }

    printf("%zu", vec.size() - 1 - idx);

    return 0;
}