/**
 * @file L1-082 种钻石.cpp
 * @date 2022-05-21
 */

/*
d.jpg
2019年10月29日，中央电视台专题报道，中国科学院在培育钻石领域，取得科技突破。科学家们用金刚石的籽晶片作为种子，利用甲烷气体在能量作用下形成碳的等离子体，慢慢地沉积到钻石种子上，一周“种”出了一颗 1 克拉大小的钻石。

本题给出钻石的需求量和人工培育钻石的速度，请你计算出货需要的时间。

输入格式：
输入在一行中给出钻石的需求量 N（不超过 10 
7
  的正整数，以微克拉为单位）和人工培育钻石的速度 v（1≤v≤200，以微克拉/天为单位的整数）。

输出格式：
在一行中输出培育 N 微克拉钻石需要的整数天数。不到一天的时间不算在内。

输入样例：
102000 130
输出样例：
784
代码长度限制
16 KB
时间限制
400 ms
内存限制
64 MB
*/

#include <cstdio>
using namespace std;

int main() {

    int n = 0, v = 0;
    scanf("%d %d", &n, &v);
    printf("%d", n / v);

    return 0;
}