/**
 * @file 7-8 521序列.cpp
 * @date 2022-05-20
 */

/*
521.jpg
所谓“521 序列”是指将一个原始整数序列 S 中的每个数字分别乘以 5、2、1 后形成的序列，
例如 S= { 5, 2, 1 } 时，其对应的 521 序列就是 { 25, 10, 5, 10, 4, 2, 5, 2, 1 } —— 
这里我们不要求这个序列一定具有某种顺序，即 521 序列中元素的顺序是可以打乱的。给定 S 后，
计算其对应的 521 序列是很简单的。但给定一个 521 序列，恢复其对应的原始序列 S 就略微复杂一点了。
本题就请你恢复任意给定的 521 序列的原始序列。

输入格式：
输入第一行给出正整数 N（<10^5），为 521 序列的长度。随后一行给出 N 个整数，即给定的 521 序列。
所有数字的绝对值不超过 10^5，以空格分隔。

输出格式：
在一行中按照非递增序输出 521 序列对应的原始序列。数字间以 1 个空格分隔，行首尾不得有多余空格。

题目保证原始序列是存在的。

输入样例：
12
1 -5 10 -1 2 4 5 -2 5 25 10 2
输出样例：
5 2 1 -1
代码长度限制
16 KB
时间限制
400 ms
内存限制
64 MB
*/

#include <cstdio>
using namespace std;

int main() {

    return 0;
}