/*
7-14 求整数段和 （15 分）
给定两个整数A和B，输出从A到B的所有整数以及这些数的和。

输入格式：

输入在一行中给出2个整数A和B，其中−100≤A≤B≤100，其间以空格分隔。

输出格式：

首先顺序输出从A到B的所有整数，每5个数字占一行，每个数字占5个字符宽度，向右对齐。最后在一行中按Sum = X的格式输出全部数字的和X。

输入样例：

-3 8
输出样例：

   -3   -2   -1    0    1
    2    3    4    5    6
    7    8
Sum = 30
*/

#include "cstdio"

int main()
{
    int A = 0, B = 0;
    scanf("%d %d", &A, &B);

    int sum = 0;
    for (int i = A; i <= B; i++)
    {
        sum += i;
        //每个数字站5个字符，用%5d，前面不足的会直接补空格，达到右对齐的效果
        printf("%5d", i);

        if ((i - A) % 5 == 4 && i != B)
        {
            printf("\n");
        }
    }
    printf("\nSum = %d", sum);

    return 0;
}