/*
7-5 表格输出 （5 分）
本题要求编写程序，按照规定格式输出表格。

输入格式：

本题目没有输入。

输出格式：

要求严格按照给出的格式输出下列表格：

------------------------------------
Province      Area(km2)   Pop.(10K)
------------------------------------
Anhui         139600.00   6461.00
Beijing        16410.54   1180.70
Chongqing      82400.00   3144.23
Shanghai        6340.50   1360.26
Zhejiang      101800.00   4894.00
------------------------------------
*/

#include "iostream"

int main()
{
    std::cout << "------------------------------------\n";
    std::cout << "Province      Area(km2)   Pop.(10K)\n";
    std::cout << "------------------------------------\n";
    std::cout << "Anhui         139600.00   6461.00\nBeijing        16410.54   1180.70\nChongqing      82400.00   3144.23\nShanghai        6340.50   1360.26\nZhejiang      101800.00   4894.00\n";
    std::cout << "------------------------------------\n";

    return 0;
}