/**
 * @file P5706 【深基2.例8】再分肥宅水.cpp
 * @date 2022-06-08
 */

/*
# 【深基2.例8】再分肥宅水

## 题目描述

现在有 t 毫升肥宅快乐水，要均分给 n 名同学。每名同学需要 2 个杯子。现在想知道每名同学可以获得多少毫升饮料（严格精确到小数点后 3 位），以及一共需要多少个杯子。输入一个实数 t 和一个整数 n，使用空格隔开。输出两个数字表示答案，使用换行隔开。

$0\leq t\leq 10000$且不超过3位小数，$1\leq n\leq 1000$

## 输入格式

## 输出格式

## 样例 #1

### 样例输入 #1

```
500.0 3
```

### 样例输出 #1

```
166.667
6
```
*/

#include <cstdio>
using namespace std;

int main() {

    double t = 0;
    int n = 0;
    scanf("%lf %d", &t, &n);
    printf("%.3lf\n%d", t / n, n * 2);

    return 0;
}